#+TITLE: Skills, Tactics, Plays - Intro
#+AUTHOR: Jay Kamat
#+EMAIL: jaygkamat@gmail.com

# Export section for md
** Basic Syntax
#+BEGIN_SRC python :exports both :results output :cache yes
  # Hello world
  print("Hello World!")

  # Set a variable
  myinteger = 1
  mydouble = 1.0
  mystr = "one"

  print(myinteger)
  print(mydouble)
  print(mystr)
#+END_SRC

#+RESULTS[e489be2aa6424fd489bf44e6633bdeefe5bebcac]:
: Hello World!
: 1
: 1.0
: one
** IF Statements and Conditionals
#+BEGIN_SRC python :exports both :results output :cache yes
  if True:
      print("RoboCup is great!")
  if False:
      print("IGVC is great...")

  if True:
      print("RoboCup is the best!")
  elif True:
      print("RoboRacing is the best...")
  else:
      print("IGVC is the best...")

  a = 5
  if a > 2:
      print("a is greater than 2!")
  if a > 2 and a < 10:
      print("a is > 2 and < 10")
  print("a is greater than 3" if a > 3 else "a is less than 3")
  print("a is greater than 9" if a > 9 else "a is less than 9")
#+END_SRC

#+RESULTS[bd799ab625a59ed63cb49f882591e36520f1f803]:
: RoboCup is the Best!
: RoboCup is Great!
: a is greater than 2!
: a is > 2 and < 10
: a is greater than 3
: a is less than 9

** Functions
#+BEGIN_SRC python :exports both :results output :cache yes
  def func1(a, b):
      return a + b

  print(func1(2, 4))

  # Lambda Expressions ('advanced' topic)
  def secret_func():
      return "RoboCup!"
  def welcome(target):
      return "Welcome to " + target()

  print(welcome(secret_func))
  print(welcome(lambda: "RoboJackets!"))
  # Lambda with arguments
  # print(welcome(lambda arg1, arg2: "RoboJackets!"))
#+END_SRC

#+RESULTS[a218e7c68935997484fc27aef176998c92a2de9a]:
: 6
: Welcome to RoboCup!
: Welcome to RoboJackets!

** Object Oriented Python
#+BEGIN_SRC python :exports both :results output :cache yes
  class BaseClass():
      globalVar = 1
      # Constructor
      def __init__(self):
          print("Initializing a Base")
          self.local_var = 2

  class ChildClass(BaseClass):
      def __init__(self):
          super().__init__() # call superclass constructor
          print("Initializing Child")
          print("Our local var is: " + str(self.local_var))

  # When defining class methods, pass 'self' as the first arg.
  # Self refers to the current class instance.
  a = BaseClass()
  print("---")
  a = ChildClass()
#+END_SRC

#+RESULTS[aa87c5fe22ac017cb1320e3c85d8277e6259e135]:
: Initializing a Base
: ---
: Initializing a Base
: Initializing Child
: Our local var is: 2

